
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 0 to add, 2 to change, 2 to destroy.</code></pre>

* Update
  * azurerm_servicebus_subscription_rule.topic_filter_rule_civil
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
* Delete
  * azurerm_key_vault_secret.civil-hmc-servicebus-shared-access-key-tf
  * azurerm_key_vault_secret.hmc-servicebus-connection-string


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_user_assigned_identity.app_mi will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_user_assigned_identity" "app_mi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "civil-aat-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-aat-rg"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)
    }

  # azurerm_key_vault_secret.civil-hmc-servicebus-shared-access-key-tf will be destroyed
  # (because azurerm_key_vault_secret.civil-hmc-servicebus-shared-access-key-tf is not in configuration)
  - resource "azurerm_key_vault_secret" "civil-hmc-servicebus-shared-access-key-tf" {
      - content_type            = "secret" -> null
      - id                      = "https://civil-aat.vault.azure.net/secrets/hmc-servicebus-shared-access-key-tf/922ee3e511f3451a9d7d628741fe81e5" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-service-aat/providers/Microsoft.KeyVault/vaults/civil-aat" -> null
      - name                    = "hmc-servicebus-shared-access-key-tf" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-service-aat/providers/Microsoft.KeyVault/vaults/civil-aat/secrets/hmc-servicebus-shared-access-key-tf/versions/922ee3e511f3451a9d7d628741fe81e5" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-service-aat/providers/Microsoft.KeyVault/vaults/civil-aat/secrets/hmc-servicebus-shared-access-key-tf" -> null
      - tags                    = {
          - "BuiltFrom"           = "https://github.com/HMCTS/civil-service.git"
          - "application"         = "civil"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#civil_contact"
          - "environment"         = "staging"
          - "managedBy"           = "Civil"
          - "source"              = "Vault civil-aat"
        } -> null
      - value                   = (sensitive value) -> null
      - version                 = "922ee3e511f3451a9d7d628741fe81e5" -> null
      - versionless_id          = "https://civil-aat.vault.azure.net/secrets/hmc-servicebus-shared-access-key-tf" -> null
    }

  # azurerm_key_vault_secret.hmc-servicebus-connection-string will be destroyed
  # (because azurerm_key_vault_secret.hmc-servicebus-connection-string is not in configuration)
  - resource "azurerm_key_vault_secret" "hmc-servicebus-connection-string" {
      - content_type            = "secret" -> null
      - id                      = "https://civil-aat.vault.azure.net/secrets/hmc-servicebus-connection-string/3e46f32e15de48569332a1ef9c2ecd69" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-service-aat/providers/Microsoft.KeyVault/vaults/civil-aat" -> null
      - name                    = "hmc-servicebus-connection-string" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-service-aat/providers/Microsoft.KeyVault/vaults/civil-aat/secrets/hmc-servicebus-connection-string/versions/3e46f32e15de48569332a1ef9c2ecd69" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-service-aat/providers/Microsoft.KeyVault/vaults/civil-aat/secrets/hmc-servicebus-connection-string" -> null
      - tags                    = {
          - "BuiltFrom"           = "https://github.com/HMCTS/civil-service.git"
          - "application"         = "civil"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#civil_contact"
          - "environment"         = "staging"
          - "managedBy"           = "Civil"
          - "source"              = "Vault civil-aat"
        } -> null
      - value                   = (sensitive value) -> null
      - version                 = "3e46f32e15de48569332a1ef9c2ecd69" -> null
      - versionless_id          = "https://civil-aat.vault.azure.net/secrets/hmc-servicebus-connection-string" -> null
    }

  # azurerm_servicebus_subscription_rule.topic_filter_rule_civil will be updated in-place
  ~ resource "azurerm_servicebus_subscription_rule" "topic_filter_rule_civil" {
      ~ filter_type                    = "SqlFilter" -> "CorrelationFilter"
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/topics/hmc-to-cft-aat/subscriptions/hmc-to-civil-subscription-aat/rules/hmc-servicebus-aat-subscription-rule-civil"
        name                           = "hmc-servicebus-aat-subscription-rule-civil"
      - sql_filter                     = "hmctsServiceId IN ('AAA7','AAA6')" -> null
        # (2 unchanged attributes hidden)

      + correlation_filter {
          + properties = {
              + "hmctsServiceId" = "AAA7"
            }
        }
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-service-aat/providers/Microsoft.KeyVault/vaults/civil-aat|civil-aat"
        name                       = "civil-aat"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 2 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2804,"Program":"tfcmt","SHA1":"","Vars":{}} -->